# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'kryptco/tap'
tap 'buo/cask-upgrade'

# Install GNU core utilities (those that come with macOS are outdated) and asdf requirements
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'libtool'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'unixodbc'

# Additional dependency for pyenv
# https://github.com/pyenv/pyenv/wiki#suggested-build-environment
brew 'xz'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'
brew 'bash-completion'

# Install `kr` dependencies
brew 'go'
brew 'rust'

# Install everything else
brew 'ack'
brew 'asdf'
brew 'awscli'
brew 'diff-so-fancy'
brew 'direnv'
brew 'fish'
brew 'gawk'
brew 'git'
brew 'gpg'
brew 'jo'
brew 'jq'
brew 'kr'
brew 'httpie'
brew 'hub'
brew 'mas'
brew 'reattach-to-user-namespace'
brew 'stow'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'

# Apps
cask '1password'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'iterm2'
cask 'keybase'
cask 'slack'
# cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
# cask 'vmware-fusion'

# fonts
cask 'font-inconsolata-nerd-font'
cask 'font-inconsolata-nerd-font-mono'
