# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'
brew 'bash-completion'

# Install Binaries
brew 'ack'
brew 'awscli'
brew 'diff-so-fancy'
brew 'fish'
brew 'git'
brew 'gpg'
brew 'hub'
brew 'mas'
brew 'stow'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'

# Apps
cask '1password'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'keybase'
cask 'slack'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# fonts
cask 'font-inconsolata-nerd-font'
cask 'font-inconsolata-nerd-font-mono'
